{"pages":[{"title":"My Photography","text":"I’ve been addicted to photography since my undergraduate period. This page records some of the images I shot all over China, and whenever I see them, I can think of the beautiful moments when I press the shutter.Please feel free to download the compressed pictures for your enjoyment, but please note that these pictures are protected by copyright and cannot be used for commerce or misappropriation. Wuhan Beijing Shanghai","link":"/Photography/index.html"},{"title":"About","text":"Education2021-2024 Master of Economics, SSDPP, Fudan University 2016-2020 Bachelor of Engineering, Dept. of Computer Science, Wuhan University 2016-2020 Bachelor of Economics, Dept. of Finance, Wuhan University Internship2022.09- Financial Engineering Group, Research Institute, Huatai Securities Co., Ltd. 2021.05-2021.08 Technical System Group, Technical Committee, Xiaomi Co.,Ltd. 2020.01-2020.05 Dept. of Terminal Management, China UnionPay Merchant Services Co., Ltd. Research Fields 量化金融 | Quantitative Finance 宏观经济 | Macro Economins 城市治理 | Urban Governance 机器学习 | Machine Learning 大数据分析 | Big Data Analytics","link":"/about/index.html"}],"posts":[{"title":"Research Progress Report for Topological Data Analysis","text":"Topological Data Analysis (TDA) is one of the emerging research methods in recent years, but its application in the financial field is not common. Since 2019, we began to use TDA to study The Chinese stock market and innovatively proposed the method of Modified TDA. This report summarizes some of our progress so far. Note: This report is only available to designated people, such as advisors, interviewers, etc. You can use the key we provide to unlock the PDF. Do not circulate the report or keep it for a long time. The report is only for recording our current research progress, rather than a draft paper. We plan to make major changes to some parts of it before we finish the draft, for example, some basic mathematical concepts that we directly refer to or simply rewrite. This PDF reader only supports desktop Chrome, Firefox, and other browsers. It does not support Safari or various mobile terminals.","link":"/2022/07/04/TDA-Finance/"},{"title":"《Bayesian Reasoning and Machine Learning》阅读笔记","text":"本篇为我在学习David Barber的《Bayesian Reasoning and Machine Learning》一书时所作的阅读笔记。 Inference in Probabilistic ModelsProbabilistic ReasoningDefinition 1.1 (Rules of Probability for Discrete Variables). The summation of the probability over all the states is 1: \\sum_{x\\in\\operatorname{dom}\\{x\\}}p(x=X)=1Definition 1.2 (Set notation). An alternative notation in terms of set theory is to write p(x\\mathrm{~or~}y)\\equiv p(x\\cup y),\\;\\;\\;\\;\\;\\;\\;\\;\\;\\;p(x,y)\\equiv p(x\\cap y)Definition 1.3 (Marginals). Given a joint distribution $\\textstyle p(x,y)$ the distribution of a single variable is given by p(x)=\\sum_{y}p(x,y)Definition 1.4 (Conditional Probability / Bayes’ Rule). The probability of event $x$ conditioned on knowing event $y$ (or more shortly, the probability of $x$ given $y$) is defined as p(x|y)\\equiv{\\frac{p(x,y)}{p(y)}} Conditional probability matches our intuitive understanding of uncertainty. Definition 1.5 (Probability Density Functions). For a continuous variable $x$, the probability density $f(x)$ is defined such that f(x)\\geq0,\\qquad\\int_{-\\infty}^{\\infty}f(x)d x=1Definition 1.6 (Independence). Variables $x$ and $y$ are independent if knowing the state (or value in the continuous case) of one variable gives no extra information about the other variable. Mathematically, this is expressed by p(x,y)=p(x)p(y)Provided that $p(x)\\neq 0$ and $p(y)\\neq0$ independence of $x$ and $y$ is equivalent to p(x|y)=p(x)\\Leftrightarrow p(y|x)=p(y)Basic Graph ConceptsBelief NetworksGraphical ModelsEfficient Inference in TreesThe Junction Tree AlgorithmMaking DecisionsLearning in Probabilistic ModelsStatistics for Machine LearningLearning as InferenceNaive BayesLearning with Hidden VariablesBayesian Model SelectionMachine LearningMachine Learning ConceptsNearest Neighbour ClassificationUnsupervised Linear Dimension ReductionSupervised Linear Dimension ReductionLinear ModelsBayesian Linear ModelsGaussian ProcessesMixture ModelsLatent Linear ModelsLatent Ability ModelsDynamical ModelsDiscrete-State Markov ModelsContinuous-state Markov ModelsSwitching Linear Dynamical SystemsDistributed ComputationApproximate InferenceSamplingDeterministic Approximate Inference","link":"/2022/10/22/brml-notes/"},{"title":"生活圈状况对健康水平的因果效应异质性探究——基于机器学习方法的检验","text":"本文补充数据请见[Github]。 Abstract: 老年人生活圈状况会对其健康水平产生影响，从生活经验上看，医院、商场、车站等离居住地较近会提高老年人看病、出行的方便性，对其健康产生一定的正向作用。机器学习方法是近些年社会科学领域新兴的因果推断方法之一。本文采用机器学习方法，一方面证明了生活圈状况与健康水平之间的因果关系确实存在，另一方面识别了不同老年群体之间的因果效应异质性。识别这种异质性有利于提出更有针对性的社会政策。 背景介绍与文献综述按照国际普遍的标准，一个国家如果60岁及以上人口占全部人口的比重超过10%，这个国家进入到老龄化社会。如果60岁及以上人口比重在10-20%之间，属于轻度老龄化阶段；20-30%之间的占比为中度老龄化阶段；超过30%是重度老龄化阶段。第七次全国人口普查结果首次披露的数据显示，我国60岁及以上人口为26402万人，占全部人口的比重是18.7%。虽然目前中国仍然处于轻度老龄化阶段，但已经可以预见，在未来五年，中国即将进入中度老龄化阶段。同时，中国老龄化的速度远超其他国家，与上个十年相比，人口老龄化速度明显加快。积极应对老龄化，要求对老年人的健康状况有所关注。环境会影响人的健康水平是不争的理论之一。这种环境既包括自然环境，也包括家庭环境、社会经济环境等。而作为环境的一个要素，老年人生活圈状况对老年人健康状况的影响是一个值得研究的话题。从生活经验上来看，当老年人居住地附近有医院、诊所等医疗设施时，一方面老年人在身体不适时可以及时医治，另一方面，老年人可能也会更加频繁地参加体检等活动，因此预期老年人的健康状况会提高。此外老年人居住地附近有商场、公园、公交站时，也会显著增加老年人日常出行的频率，从而起到锻炼身体的作用，也会对其健康起改善作用。 对于老年人健康状况及其影响因素的探究并不是一个新鲜的话题，很多学者从各种各样的角度探讨过这一问题。姜向群等（2015）以社会-心理-生物医学模式为理论分析框架，探究了自然属性、社会经济结构特征、患病或损伤状况、心理状况以及童年医疗状况等因素对老年人健康状况（健康自评状况、日常生活自理能力）的影响。薛新东和葛凯啸（2017）以CHARLS数据为基础，探究了社会经济地位对我国老年人自评健康和心理健康的影响效应，以及饮食方式、体育锻炼、社会参与和睡眠质量是否为这一影响的中介变量。曾毅等(2014)基于全国22省市一万多位老人2002—2005年跟踪调查数据，应用多水平多元logit模型,对社会经济和自然环境因素对老年健康和死亡的影响进行了分析。宋全成和张倩（2018）使用2015年全国流动人口动态监测调查数据，综合分析个体因素、流迁因素、医疗卫生因素和社会经济因素对中国老年流动人口健康状况的影响。曾宪新（2010）利用”中国老年人口健康影响因素跟踪调查”2008年横向数据，构建躯体虚弱指数和精神虚弱指数等老年健康综合指标，分析了年龄、性别、城乡差异对于老年人健康的影响。然而，一方面对于老年人生活圈状况对其健康水平的影响似乎还很少有人去实证检验，影响程度的大小还没有人在实证中精确地表现出来。另一方面正如任国强等（2022）指出，许多文献所指出的影响因素与健康之间的关系是相关而非因果关系，而真正对政策制定有用的是因果关系而非相关关系。 针对这些问题，一些学者也提出了用严谨的因果推断方法而非回归模型来进行研究。因果推断方法的应用往往集中在个体健康研究领域而不一定是老年人的健康状况，具体有工具变量法（IV）、断点回归法（RDD）、倾向得分匹配法（PSM）、双重差分法(DID)等。PSM、DID等传统因果推断方法都是基于反事实的潜在结果来定义因果关系。潘杰等（2013）采用各城市对参保人群的政府补助比例作为工具变量，估计了城镇居民基本医疗保险对城镇居民健康的影响。Huo等（2020）利用倾向得分匹配的方法，研究了低保的参与对成年人心理健康的影响，发现低保参与对农村地区的女性有着显著的负面影响，但对于城市男性影响很弱。然而这些传统的因果推断方法并不是完美的，可能各自有其弊端，例如想找到一个合适的工具变量可能非常困难；倾向得分匹配法对数据量和数据质量的要求特别高；双重差分法中个体时点效应未得到控制等等。此外可以看到，对个体健康水平的因果推断往往仅识别了平均意义上的处理效应，而忽视了处理效应对于特定人群的异质性，而处理效应的异质性带来的政策差异性正好是本文想要关注的重点之一。 基于以上这些在本文研究主题上的欠缺之处，本研究从实证上要探讨以下两个问题：老年人生活圈状况与其健康状况是否存在因果关系？不同特征的老年人之间，这一因果效应是否存在大小上的差别？在回归中添加交互项的方法或者倾向值方法都可以用来研究处理效应的异质性，但传统回归模型的交互项分析主要有两个问题：交互项不能无限制添加，以及交互项的设定具有主观性；倾向值方法存在模型和系数不确定，以及无法确定具体起异质化作用的混淆变量的问题（胡安宁等，2021）。机器学习方法完全是数据驱动型，最擅长精准的预测或干预，对于因果分析中缺失的反事实状态，机器学习完全可以通过建模得到最贴近实际的取值，由此可以从传统数据中发现不易察觉的因果关系。此外，机器学习方法的“分类”作用完全可以识别处理效应的异质性特征，且没有交互项和倾向值方法的弊端。因此本文选择了机器学习方法来进行实证检验。本文的主要贡献在于：（1）在社会科学领域创新性地使用了机器学习方法来进行因果效应的识别与检验，因此，本文属于计算社会科学的范畴。（2）本文不仅关注生活圈便利情况对老年人健康水平是否有因果影响，更关注对不同群体老年人影响的异质性。作为社会科学的研究者，对机器学习等方法使用不在于研究一项新技术，而在于从数据中挖掘出更多有用的信息以指导社会政策的实践。识别处理效应的异质性有利于对症下药制定不同的政策，这就使因果推断向更高一步拓展。（3）用不同机器算法对这一问题进行了探究，并比较了不同算法在本问题上的优劣之处。 方法与实证检验数据来源本文的数据直接来自于上海市教委科研创新计划人文社科重大项目“新时代中国人口发展战略研究”的第二项社会调查。本次社会调查主要通过问卷的形式进行，问卷包含了被调查人基本信息与家庭结构、就业与经济供养、生理与心理健康、保障与养老、老年生活与满意度五个方面接近一百个问题，涉及面广。本次调查共收集到4675份答复问卷，我们剔除50岁以下的样本,通过写变量逻辑检验进行样本清洗，最终保留了4462个有效样本。从样本分布上看，样本涵盖了50-90岁各年龄段、全国各个省份、不同职业状态及家庭状况的群体，具有分布广泛、代表性强的特点。 变量选择本研究的被解释变量为老年人的自评健康状况（1=非常健康；2=健康；3=一般；4=不健康；5=非常不健康），处理变量为样本的生活圈状况（1=方便；2=不方便）。处理变量的选择在利用社会调查数据做实证检验时具有难度，主要因为社会调查数据并非出自随机实验，我们无法保证对样本施加处理与否是完全外生的。例如，不同特征的老人可能会自行选择在不同的生活圈居住（身体欠佳的选择在靠近医院的地方居住、爱好出行的选择在公交站附近居住等）。为解决该问题，本文将不同的生活圈状况联合起来作为处理变量，具体来说，只有当被调查对象居住地附近一公里内同时有医院/诊所、超市/购物中心、地铁站/公交站时，我们将其归为处理组，否则将其归为对照组。事实上老年人在选择居住地生活圈条件时，基本上很少会同时满足这三项条件，因此我们可以近似认为这一处理变量是完全外生的，我们的实验近似看作一个准自然实验（CRAIG等，2017）。 本文选取了其他一些变量作为本实验的混淆变量，这些变量直接或者间接衡量了样本目前的生活状况、身心健康状况、社交状况等，体现了样本之间的异质性。混淆变量具体包括：年龄，性别（1=男；2=女），文化程度（1=基本不识字；2=私塾、扫盲班等；3=小学；4=初中；5=高中(包括中专、职高)；6=大专/高职；7=大学本科；8=硕士研究生及以上），户口（1=农村人口；2=城镇人口），户籍地和常住地关系（1=户口和常住地都在同一个区/县；2=户口和常住地在同一个市，但是在不同区/县；3=户口和常住地在同一个省，但是在不同的市；4=户口和常住地在不同的省），婚姻状况（1=未婚；2=初婚有配偶；3=再婚有配偶；4=离异；5=丧偶），同住人数，自评家庭经济（1=很富裕；2宽裕；3=一般；4=困难；5特别困难），自评代际关系（1=非常亲密；2=亲密；3=一般；4=有点疏远；5=疏远），半年内去医院看病与否（1=有；2=无），自评孤独感（1=经常；2=有时；3=偶尔；4=几乎不），认可“老年人是社会的负担”说法的程度（1=十分赞同；2=比较赞同；3=一般；4=不赞同；5=十分不赞同），自评幸福程度（1=非常幸福；2=幸福；3=一般；4=不幸福；5=非常不幸福），拥有养老保险种类数，拥有医疗保障种类数，居住地情况（1=自己家中；2=儿子家中；3=女儿家中；4=养老院中；5=其他），智能手机使用状况（1=使用；2=不使用），锻炼状况（1=经常锻炼；2=有时锻炼；3=偶尔锻炼；4=几乎不锻炼），本居住地经常交往的朋友数量（1=没有；2=1-3人；3=10人以下（多于3人）；4=10-20人；5=20人以上），自评生活满意度（1=非常满意；2=满意；3=一般；4=不满意；5=非常不满意）。各变量的描述性统计如表1所示。 Mean Stdev Minimum Lower quartile Median Upper quartile Maximum ID 2231.5 1288.2127 1 1116.25 2231.5 3346.75 4462 Y 2.490587 0.836982 1 2 2 3 5 W 0.626625 0.483755 0 0 1 1 1 age 60.05714 9.473407 50 52 57 67 90 gender 1.535858 0.498768 1 1 2 2 2 edu 4.527342 1.922983 1 3 5 6 8 hukou 1.581802 0.493318 1 1 2 2 2 same 1.323846 0.789281 1 1 1 1 4 hunyin 2.387943 0.946622 1 2 2 2 5 tongzhu 3.349395 1.898707 0 2 3 4 39 zipingjj 2.981398 0.630513 1 3 3 3 5 zipingdj 2.132452 0.870797 1 2 2 3 6 kanbing 1.551546 0.497392 1 1 2 2 2 gudu 3.099731 0.959926 1 2 3 4 4 fudan 3.62035 0.987125 1 3 4 4 5 zipingxf 2.240251 0.703922 1 2 2 3 5 baoxiannum 1.266472 0.731978 0 1 1 2 7 yibaonum 1.085388 0.629982 0 1 1 1 6 juzhu 1.267369 0.763143 1 1 1 1 5 phone 1.19117 0.393267 1 1 1 1 2 exercise 2.046168 1.024087 1 1 2 3 4 friend 3.098835 1.106259 1 2 3 4 5 zipingsh 2.156656 0.744628 1 2 2 3 5 处理效应异质性传统的因果推断分析，主要是在平均意义上展开的，其关注的焦点是平均处理效应（average treatment effect），即 \\mathrm{ATE}=\\mathbb{E}[Y(1)-Y(0)]Y(1)和Y(0)分别为处理组和对照组的表现。平均处理效应仅关注施加一个处理后，两个组别总体上来看是否呈现一定的差异性，但并不关注每组中具体样本的差异细节。随着科学界和政界对于因果推断的需求越来越精细化和准确化，越来越多的学者开始关注处理效应的异质性。异质性处理效应关注的是对于不同的群体（例如不同年龄段、不同工作等），处理组与对照组之间的差异是否相同。比如说，大量的以政策分析为导向的研究关注特定人群之间有差异的处理效应，以便精准对特定人群采取特定政策；假设处理方法是一种药物，该药物的人群平均效应可能不是阳性的，但是对特定类别的患者可能有效，药学研究也会关注药物在不同群体中的表现。估计个体处理效应时的数据由（Xi，Wi，Yi）3部分组成，其中i＝1，2，…，n代表个体，Xi为一组协变量向量，Wi为处理分配变量，Wi∈{0，1}表示2种不同的处理，Yi为结局变量。条件处理效应的公式可定义为条件处理效应的公式可定义为： \\tau(x)=\\mathbb{E}[D \\mid X=x]=\\mathbb{E}[Y(1)-Y(0) \\mid X=x]在研究异质性因果效应的时候需要满足两个基本假设：首先，倾向值必须在0到1之间，即处理组和对照组都必须有样本，样本不能全部被处理或者全部不被处理。在我们的研究数据中，处理组，即居住地附近一公里内同时有医院/诊所、超市/购物中心、地铁站/公交站的为2796人，对照组为1666人，满足这一假设条件。其次，在给定一个样本的情况下，他是否被处理与他自身无关。我们在变量选择这一节已对该点进行了详细阐释，这里不再赘述。 估计异质性处理效应的机器学习方法有贝叶斯叠加回归树（Chipman和Mcculloch， 2010）等。Athey和Imbens（2016）将机器学习中常用的CART分类回归决策树引入到了传统的因果识别框架，定义了因果树（causal tree）的概念，用它们来考察异质性处理效应。而后Wager和Athey（2018）又推广了因果树方法，讨论了如何用随机森林算法来整合因果树并估计异质性处理效应，称为因果森林（causal forests）。值得一提的是，Athey是斯坦福大学商学院的著名经济学教授，而Imbens因其在因果推断领域的重大贡献获得过诺贝尔经济学奖，因此他们提出的因果树模型以及衍生的因果森林模型堪称经济学因果研究领域的大革命。 基于因果树的处理效应异质性分析CART（classification and regression tree）分类回归树算法是最经典的决策树算法之一，既可用于分类也可用于回归。分类树的输出是样本的类别，回归树的输出是一个实数。假设X和Y分别为输入和输出变量，并且Y是连续变量，给定训练数据集$D=\\left\\{\\left(x_{1}, y_{1}\\right),\\left(x_{2}, y_{2}\\right), \\ldots,\\left(x_{N}, y_{N}\\right)\\right\\}$，在划分树的过程中，首先寻找最优切分变量j和最优切分点s，满足$\\min _{j, s}\\left[\\min _{c_{1}} \\sum_{x_{i} \\in R_{1}(j, s)}\\left(y_{i}-c_{1}\\right)^{2}+\\min _{c_{2}} \\sum_{x_{2} \\in R_{2}(j, s)}\\left(y_{i}-c_{2}\\right)^{2}\\right]$，其中，$c_{1}=\\operatorname{ave}\\left(y_{i} \\mid x_{i} \\in R_{1}(j, s)\\right)$ ，$c_{2}=\\operatorname{ave}\\left(y_{i} \\mid x_{i} \\in R_{2}(j, s)\\right)$。其次，用选定的（j，s）划分区域，并决定输出值。对两个子区域继续调用前两个流程，直到每个节点不能再分割或者样本数达到最低限制。决策树是充分考虑了所有的数据点而生成的复杂树，它在学习的过程中为了尽可能的正确的分类训练样本，不停地对结点进行划分，因此这会导致整棵树的分支过多，造成决策树很庞大。决策树过于庞大，有可能出现过拟合的情况，决策树越复杂，过拟合的程度会越高。因此我们往往对生成的决策树进行预剪枝（pre-pruning）或者后剪枝（post-pruning）。 因果树模型是对CART决策树模型的改进，是采用生成树的方式进行异质性因果效应的检验。相较于普通回归型决策树，因果树主要在如下方面做了重大改进：一是将原来的训练集样本随机分成两部分，一部分用于生成树（train set），另一部分用于给出预测值（estimate set）。即在训练样本上训练模型，模型训练好以后放到估计样本上计算估计值，最后使用该估计值在测试集上计算MSE来判断模型的好坏。二是修改了MSE的表达式，使其更聚焦于处理效应。普通的CART回归型决策树分裂以及评价的标准都是看MSE，即 \\begin{equation} \\arg \\min _{\\prod_{i}} M S E_{i}=\\frac{1}{n} \\sum_{i=1}^{n}\\left(Y_{i}-\\bar{Y}_{j: x_{j} \\in l\\left(x_{i} \\mid \\Pi_{i}\\right)}\\right) \\end{equation}其中$l\\left(x_{i} \\mid \\prod_{i}\\right)$表示在$\\prod_{i}$的划分情况下, $x_{i}$所在的叶子结点。因果树对上述MSE的公式做了改进，主要有两点变化：一是直接用$\\tau$代替了MSE公式中的Y；二是减去了$\\tau^{2}$： \\operatorname{MSE}_{\\tau}\\left(\\mathcal{S}^{\\text {te }}, \\mathcal{S}^{\\text {est }}, \\Pi\\right) \\equiv \\frac{1}{\\left(\\mathcal{S}^{\\text {te }}\\right)} \\sum_{i \\in \\mathcal{S}^{\\text {te }}}\\left\\{\\left(\\tau_{i}-\\hat{\\tau}\\left(X_{i} ; \\mathcal{S}^{\\text {est }}, \\Pi\\right)\\right)^{2}-\\tau_{i}^{2}\\right\\}至于因果树其他实现细节的推导，建议读者直接参考Athey和Imbens的论文。 依据机器学习方法惯例，我们将我们的研究样本进行随机切割，80%的样本用于进行模型训练以生成因果树，20%的样本用于检测模型效果的好坏。80%的训练样本中，我们又对半切割，一半用于生成树结构，另一半用于使用Honest算法计算各个节点处理效应。我们使用以上所述的生成步骤生成了一棵完整的因果树，并通过交叉验证进行剪枝操作（避免过拟合），最终得到的因果树如图1所示。不同分支代表了我们的样本按照混淆变量可以分成不同的组别，每个组别的处理效应都具有异质性。每个叶子节点的数值代表该分组的处理效应的大小，百分数代表落到该组别的样本的比例。观察我们得到的因果树模型，我们可以得到如下一些结论： （1）因果树模型共有28个节点，其中处理效应为负的节点有20个，涵盖了超过半数的样本。由于在因变量自评健康水平中，较小的数值代表了较高的健康水平，因此我们可以推断在某种程度上，完善的生活圈设施确实可以带来老年人更高的健康水平。这个结果也符合我们的预期。 （2）在二十几个混淆变量中，年龄对处理效应的异质性发挥了最先切割的作用。在年龄大于等于74岁的老年人群体中，处理效应为负的比例远大于其他分组，说明生活圈状况对于这一部分老年群体的影响较大。事实上，所有叶子节点中负值绝对值最大的就出现在这一分组，年纪更大的老年人可能有更多的看病等需求，我们特地查看了这部分老年人户籍地和常住地是否在同一个地点，发现same这一混淆变量均为1，即户口和常住地都在同一个区/县，这证实了我们的猜测，即本地年龄较大的老人可能会更加依赖家附近的公共设施。 （3）几个叶子结点都表明，对于经常锻炼的老年人，在施加“完善生活圈状况”这一处理下，其平均健康水平提高程度普遍高于锻炼次数较少的老年人。这一处理效应差异也符合我们的预期，对于爱好锻炼的老人，在其居住地周围布置商场、车站，一定程度上会激发其多出行的欲望，从而起到了锻炼身体的作用。而不太爱锻炼的老人可能对这一处理无感。 （4）在小于74岁的老年被调查群体中，农村户籍人口（hukou=1）处理效应为负的比例远远大于城市户籍人口。事实上，农村的公共设施建设目前可能还远远比不上城市，当农村人口面临出行、看病等需求时，往往需要走很长的路程甚至山路，因此他们更容易忽视日常出行锻炼或者身体健康监测。因此当显著改善他们的生活圈状况时，可能也会显著提高他们的健康水平。 （5）部分样本组出现了处理效应为正的情况，即生活圈条件完善反而使其自评健康水平降低。但仔细观察可以发现，这部分群体要么半年之内已经去医院看过病，要么年龄已经大于72岁。我们认为这部分群体可能本身健康状况就欠佳，居住地靠近医疗设施可能使其更加关注并发现自己身体的异样状况，并在因变量上作出体现。这更体现了在老年群体生活区周围布置医疗场所以便其关注自身健康状况的重要性。 做以上几点阐释的原因在于说明因果树里包含了很多有用的信息，我们这里只讨论了一些非常显著的结论。不同的群体在面临某一处理时会呈现充满异质性的结果，更多的结论可以由阅读者去发掘。需要注意的是，和传统的因果推断方法不同，机器学习方法高度依赖于数据并且旨在发现即使非常微小的因果关系，有些识别出来的因果关系非常微弱以至于凭借我们的经验无法合理去解释它。但这没有关系，只要我们可以凭借这一处理效应制定出对症下药的政策，则其就是有效的。针对异质性处理效应的政策讨论，我们将在文章最后一个部分集中进行。 基于因果森林的处理效应异质性分析本文所使用的因果森林算法基于R-Learner，在R-Learner中，我们定义$e(x)=P[W=1 \\mid X=x]$ 和$m(x)=E[Y \\mid X=x]$，首先对于样本，用任意算法估计响应函数$\\hat{e}(x)$ 和 $\\hat{m}(x)$，其次，最小化损失函数$\\sum_{i=1}^{n}\\left(\\left(Y_{i}-\\hat{m}^{(-i)}\\left(X_{i}\\right)\\right)-\\tau\\left(X_{i}\\right)\\left(W_{i}-\\hat{e}^{(-i)}\\left(X_{i}\\right)\\right)\\right)^{2}$。具体在操作时，我们首先用两个含500棵树的随机森林对$\\hat{e}(x)$ 和 $\\hat{m}(x)$进行建模，然后用$\\hat{e}(x)$ 和 $\\hat{m}(x)$来进行袋外估计，构造一个因果森林： \\begin{equation} \\hat{\\tau}(x)=\\frac{\\sum_{i=1}^{n} \\alpha_{i}(x)\\left(Y_{i}-\\hat{m}^{(-i)}\\left(X_{i}\\right)\\right)\\left(W_{i}-\\hat{e}^{(-i)}\\left(X_{i}\\right)\\right)}{\\sum_{i=1}^{n} \\alpha_{i}(x)\\left(W_{i}-\\hat{e}^{(-i)}\\left(X_{i}\\right)\\right)^{2}} \\end{equation} \\begin{equation} \\alpha_{i}(x)=\\frac{1}{B} \\sum_{b=1}^{B} \\frac{1\\left(\\left\\{X_{i} \\in L_{b}(x), i \\in B\\right\\}\\right)}{\\left|\\left\\{i: X_{i} \\in L_{b}(x), i \\in B\\right\\}\\right|} \\end{equation}其中，$B$是森林中树的数量，$L_{b}(x)$是$x$在树$b$的叶子结点。预测结果的分布确实显示出了一定的异质性（图2）。表2统计了树的分裂过程中不同变量使用频率，可以看到年龄、户口、社交情况等因素都是决定异质性分组的重要变量。 x x age 0.250803705 phone 0.034488854 hukou 0.078407178 juzhu 0.033221324 gender 0.061176557 exercise 0.030773181 edu 0.056819267 hunyin 0.03008792 friend 0.055576528 zipingjj 0.029583317 tongzhu 0.053783047 gudu 0.029257139 yibaonum 0.051690669 zipingdj 0.027936003 fudan 0.041057904 zipingsh 0.02148558 zipingxf 0.040721237 baoxiannum 0.020985807 kanbing 0.037348592 same 0.01479619 基于X-Learner的处理效应异质性分析Künzel等（2018)提出了一种新的元算法，即X-Learner算法，X-Learner在当处理组和对照组样本数量差距很大时往往会取得很好的效果。X-Learner具体由以下步骤组成：（1）用任意的监督学习或者回归算法估计相应函数，用$\\hat{\\mu}_{0}$和$\\hat{\\mu}_{1}$表示估计量。（2）根据对照组的模型来计算处理组中的个体处理效应，根据处理组的模型来计算实验组中的个体处理效应。用公式表示为：$\\tilde{D}_{i}^{1}=Y_{i}^{1}-\\hat{\\mu}_{0}\\left(X_{i}^{1}\\right)$ ，$\\tilde{D}_{i}^{0}=\\hat{\\mu}_{1}\\left(X_{i}^{0}\\right)-Y_{i}^{0}$。（3）通过（2）中计算得到的两个估计量进行加权计算CATE估计量：$\\tau(x)=g(x)\\hat{\\tau}_{0}+(1-g(x)) \\hat{\\tau}_{1}(x)$，$g(x)$为加权函数，常常就用倾向值大小来表示。我们用基于随机森林基学习器的X学习器，同样对样本数据估计了异质性效应，但由于X-Learner无法像树形结构一样给出直观的异质性结构，因此这里不做展示，有兴趣者可直接向作者索取。 不同机器学习方法的检验对于测试集中的每一个样本，我们分别用因果树方法、因果森林方法、X-Learner方法计算了个体的处理效应，我们通过计算测试集上三种方法预测的处理效应与真实的处理效应之间的差异，来综合比较三种方法的好坏。一个问题是我们并不知道真实处理效应的大小，为了解决这一问题，我们定义$Y_{i}^{*}$为以下形式： \\begin{aligned} Y_{i}^{*} &:=\\left\\{\\begin{array}{lll} \\frac{1}{p} Y_{i} & \\text { if } & W_{i}=1 \\\\ \\frac{-1}{1-p} Y_{i} & \\text { if } & W_{i}=0 \\end{array}\\right.\\\\ &=\\frac{W_{i}-p}{p(1-p)} Y_{i} & \\end{aligned}则 \\begin{aligned} E\\left[Y_{i}^{*}\\right] &=P(W=1) E\\left[Y_{i}^{*} \\mid W=1\\right]+P(W=0) E\\left[Y_{i}^{*} \\mid W=0\\right] \\\\ &=p E\\left[\\frac{1}{p} Y_{i} \\mid W=1\\right]+(1-p) E\\left[\\frac{-1}{1-p} Y_{i} \\mid W=0\\right] \\\\ &=p E\\left[\\frac{1}{p} Y_{i}(1)\\right]+(1-p) E\\left[\\frac{-1}{1-p} Y_{i}(0)\\right] \\\\ &=E\\left[Y_{i}(1)-Y_{i}(0)\\right] \\\\ &=E\\left[\\tau_{i}\\right] \\end{aligned} \\begin{aligned} E\\left[\\left(Y_{i}^{*}-\\hat{\\tau}\\left(X_{i}\\right)\\right)^{2}\\right] &=E\\left[\\left(Y_{i}^{*}-\\tau_{i}+\\tau_{i}-\\hat{\\tau}\\left(X_{i}\\right)\\right)^{2}\\right] \\\\ &=E\\left[\\left(Y_{i}^{*}-\\tau_{i}\\right)^{2}\\right]+E\\left[\\left(\\tau_{i}-\\hat{\\tau}\\left(X_{i}\\right)\\right)^{2}\\right]+2 E\\left[\\left(Y_{i}^{*}-\\tau_{i}\\right)\\left(\\tau_{i}-\\hat{\\tau}\\left(X_{i}\\right)\\right)\\right] \\\\ &=\\text { const }+E\\left[\\left(\\tau_{i}-\\hat{\\tau}\\left(X_{i}\\right)\\right)^{2}\\right]+0 \\end{aligned}因此我们可以用$Y_{i}^{*}$和$\\hat{\\tau}\\left(X_{i}\\right)$的差值来代替$\\tau_{i}$和$\\hat{\\tau}\\left(X_{i}\\right)$的差值。计算得到普通损失函数$E\\left[\\left(\\tau\\left(X_{i}\\right)-\\hat{\\tau}\\left(X_{i}\\right)\\right)^{2}\\right]$。我们同样使用R损失函数计算了三种方法的误差，R损失函数定义为$E\\left[\\left(e\\left(X_{i}\\right)\\left(1-e\\left(X_{i}\\right)\\right)\\left(\\tau\\left(X_{i}\\right)-\\hat{\\tau}\\left(X_{i}\\right)\\right)\\right)^{2}\\right]$，其对于每个样本是否接受处理的倾向值不确定时最有效。从检验结果（表3）来看，但我们使用普通损失函数的时候，因果树的效果最好；而当我们使用R损失函数的时候。因果森林取得最低的误差。X-Learner无论用何种损失函数效果都不如树方法，事实上，X-Learner在对照组与处理组的样本数量差异悬殊时可能效果会更佳，然而本实验样本并不满足该条件。 mean se rloss_mean rloss_se Causal_Tree_Loss 30.61253606 0.978268597 0.542655434 0.027838508 Causal_Forest_Loss 30.93696914 1.005725152 0.522895375 0.027122205 X_Learner_Loss 30.94656489 1.004602995 0.523729079 0.027201197 总结与讨论随着社会科学研究中数据量的快速膨胀，社会政策的数据驱动型制定也正在成为主流。本研究的亮点在于将机器学习方法引入个体健康水平影响因素的因果推断之中，分析了老年人生活圈状况对自评健康水平影响的异质性。评估生活圈状况对老年人健康水平的因果效应，我们的目的不仅在于评价处理效应的异质性，更要分析异质性对社会政策制定产生的影响。根据我们得到的异质性处理效应，我们举出如下政策范例：（1）从普遍情况来看，改善老年人居住地周围的设施情况，积极布局医疗、车站、商超等设施确实在一定程度上导致了老年人健康水平的提高。在政策制定方面，可以考虑在老年人群居小区周围积极筹划“十五分钟生活圈”，方便老年人看病、购物、散步的需求，来促进老年人以至于整个社会的健康水平的增长。（2）缺乏医院等基础设施对于农村地区老年人健康水平产生的负面影响会显著大于城市地区，因此一方面有必要在农村加大提供医疗卫生服务的力度，另一方面也要向农村老年人宣传关注自己身体健康的重要性。（3）通过在老年人群居社区周围积极设置公园等场所，提高老人的锻炼次数以及社交能力，一定程度上对其他公共设施促进老年人健康水平提高起推动作用。（4）积极调查社区老年人口平均年龄情况和户籍情况，对70岁以上年龄老人较多的社区，要尤其注意他们的生活圈状况改善。对于居住地非户籍地较多、外来人口较多的老年人社区，也可考虑一些公共设施的改善。仔细观察我们的异质性处理效应因果树，相信读者也会得到自己的一些政策建议。 当然本文也有一些不足之处，这些不足之处或来自于我们的数据选取，或来自于我们的实验方法，具体来说：（1）为了得到具有良好泛化能力的统计模型，机器学习方法对于训练样本的数据量及数据质量提出了极高的要求。虽然本文具有四千多个有效样本，但对于动辄使用上万样本的因果树方法而言，似乎还是有所不足。若是可以在更多的数据集上使用此方法进行因果推断，相信会有更准确的实验结果。事实上，即使是CHARLS这样全国大范围的老年人健康调查，也不过仅能提供全国1.24万户家庭中的1.9万名受访者，相比于全国数以亿计的医院看病数据、社会保险数据、医疗保险数据来说，还是显得微乎其微且研究准确性很低。因此，有学者提出政府在保障数据安全的前提下，联合各部门建立互联互通的健康大数据共享平台，以方便学者对全国范围的老年人健康状况进行调查。（2）老年人健康水平的指标有发病率指数、身体质量指数、特定疾病诊断等，但研究界用的最多的还是自评健康水平（Self-Reported Health，简写为SRH）。使用老年人自评健康水平作为真实健康水平的代表一直饱受争议，一方面缺乏一个统一的评判标准，每个人的答案都是基于自己的主观感受；另一方面也要面临非理性和非真实填写的情况。针对这一问题，如果可以开发出标准的老年人健康水平测量表也可以解决，但可能会面临题目繁琐导致问卷收回率很低的问题，因此在问卷调查中一般也不可行，所以目前大部分文献还是基于老年人自评健康水平来进行研究的。以中国健康与养老追踪调查（CHARLS）数据为例，其在问卷中和我们一样，假设SRH是对个体健康状态的真实反映。（3）目前机器学习方法在社会科学领域应用还很少的原因除了数据的不足外，还有很多学者对于它的可解释性提出了质疑。机器学习方法的优点在于精准的预测和分类，但对数据的挖掘造成很大程度上不能为结果提供一个社会学角度的解释。但是正如前文中所说，因果关系识别有时候会比解释更重要，当我们知道A会导致B时，就足以支持我们制定相应的政策，而未必要一定要知道为什么A会导致B。这种观点也正被越来越多学者所接受，相信机器学习方法在未来也会为研究者提供新的研究手段和研究视野。 参考文献[1]姜向群,魏蒙,张文娟.中国老年人口的健康状况及影响因素研究[J].人口学刊,2015,37(02):46-56. [2]薛新东,葛凯啸.社会经济地位对我国老年人健康状况的影响——基于中国老年健康影响因素调查的实证分析[J].人口与发展,2017,23(02):61-69. [3]曾毅,顾大男,Jama Purser,Helen Hoenig,Nicholas Christakis.社会、经济与环境因素对老年健康和死亡的影响——基于中国22省份的抽样调查[J].中国卫生政策研究,2014,7(06):53-62. [4]宋全成,张倩.中国老年流动人口健康状况及影响因素研究[J].中国人口科学,2018(04):81-92+127-128. [5]曾宪新.我国老年人口健康状况的综合分析[J].人口与经济,2010(05):80-85. [6]任国强,王于丹,周云波.科学研究中因果推断的方法、应用与展望——以个体健康研究为例[J].人口与经济,2022(02):1-25. [7]潘杰,雷晓燕,刘国恩.医疗保险促进健康吗?——基于中国城镇居民基本医疗保险的实证分析[J].经济研究,2013,48(04):130-142+156. [8]Xuan Huo et al. Effects of welfare entry and exit on adolescent mental health: Evidence from panel data in China[J]. Social Science &amp; Medicine, 2020, 253(C) : 112969. [9]胡安宁,吴晓刚,陈云松.处理效应异质性分析——机器学习方法带来的机遇与挑战[J].社会学研究,2021,36(01):91-114+228. [10]CRAIG P, KATIKIREDDI S V, LEYLAND A.Natural experiments:an overview of methods,approaches,and contributions to public health intervention research[J].Annual Review of Public Health,2017,38(1):39-56. [11]Chipman H A , Mcculloch G R E . BART: BAYESIAN ADDITIVE REGRESSION TREES[J]. Annals of Applied Statistics, 2010, 4(1):266-298. [12]Athey S, Imbens G. Recursive partitioning for heterogeneous causal effects[J]. Proceedings of the National Academy of Sciences, 2016, 113(27): 7353-7360. [13]Wager S, Athey S. Estimation and inference of heterogeneous treatment effects using random forests[J]. Journal of the American Statistical Association, 2018, 113(523): 1228-1242. [14]Künzel, Sören R., et al. Metalearners for estimating heterogeneous treatment effects using machine learning. Proceedings of the national academy of sciences 116.10 (2019): 4156-4165.","link":"/2022/07/28/health-hte/"},{"title":"基于高斯混合模型的中国城市聚类研究","text":"这篇文章为我用高斯混合模型用于城市研究的一个小demo。代码可见[Github]。 Abstract: 城市等级划分对于厘清城市之间的差异，制定科学规划有重要意义，但实际上目前城市等级划分层出不穷，甚至自相矛盾，缺乏可以用于学术研究的通过严谨计算得到的城市等级标签。为此，国家统计局城市司提出，要制定科学统一的“X线城市”分级标准。本文旨在提出一种符合学术规范的城市分级方法，采用高斯混合模型，依据中国290个地级市的人口、GDP、财政、灯光等数据，将中国城市划分为若干等级，且每个等级内的城市符合一个多维高斯分布。 1 介绍不同的城市往往具有不同等级的房价[Rappaport et al., 2007]、GDP、人口、财政等数据, 因此我们认为中国城市可以被分为若干个等级，每个等级内的城市具有各维度高度的相似性。实际上，给定一些维度上的城市数据，城市等级的划分其实就是城市聚类的过程。《第一财经》用商业资源集聚度、城市枢纽性、城市人活跃度、生活方式多样性和未来可塑性五大一级维度，透过主流消费品牌的商业门店数据、各领域头部互联网公司的用户行为数据和数据机构的城市大数据，衡量337 座中国地级及以上城市的商业魅力。根据《第一财经》的划分，北京、上海、广州、深圳为一线城市，成都、南京、武汉、深圳等15 个城市为新一线城市，合肥、昆明、嘉兴等30 个城市为二线城市，以及70 个三线城市和90个四线城市。 城市等级划分具有极其重要的意义。城市分级的研究对于一个城市认清自身在全国城市经济体系中的地位有参考作用。同时，准确对城市进行分级也是进行科学发展规划的前提[郭靖and 倪鹏飞,2021]。在学术上，例如在计量经济学模型中，城市等级完全可以作为一个虚拟变量加入模型，来衡量城市规模对于被解释变量（例如房价、交通等）的影响。关于城市该如何分级，学术圈和各机构都有过探讨。Friedmann 和Sassen 都认为跨国公司集中度是高等级城市的代表，因此分别采用一个城市中跨国公司集聚数量[Friedmann, 1986] 和先进生产性服务业企业集中度[Sassen, 2001] 来为城市分级；GaWC通过检验城市的经济、政治地位以及辐射带动能力，确定一座城市在世界城市网络中的位置。中国目前使用最广的城市分级主要是《第一财经》的城市商业魅力排行榜，也有学者提出自己的标准，例如使用信息、专利、知识等软功能指数以及航空、跨国公司、高端产业等硬功能指数进行城市的层次聚类[郭靖and 倪鹏飞, 2021]。然而，现实中很少有研究者在学术研究中引用城市等级标签，原因之一就是缺乏严谨计算得到的城市等级。层出不穷的城市排行提供的不同乃至自相矛盾的信息让城市管理者和社会大众无所适从，制定科学统一的“X 线城市”分级标准很有必要[张丽萍, 2020]。因此，本文提出了一种计算得到城市聚类标签的方法。我们用高斯混合模型对中国地级市进行聚类分析，划分出若干等级，每个等级内的城市符合同一个高斯分布，是出于以下考虑：（1）根据最大熵原理[Jaynes, 1957]，在精确说明先验数据的情况下，最能代表系统当前知识状态的概率分布是熵最大的概率分布。当均值和方差已知时，高斯分布的熵是所有分布中最大的；（2）现实中的很多随机变量是由大量相互独立的随机因素的综合影响所形成的，而其中每一个别因素在总的影响中所起的作用都是微小的，这种随机变量往往近似服从高斯分布。 2 数据本文所使用的数据集整理自《中国城市统计年鉴》、wind 经济数据库，以及中国各地级市的第七次人口普查公报、经济社会发展公报等。本文采集了中国290 个地级市（由于重庆市的体量相当于一个省，因此本文中重庆市的数据范围为主城九区）十个维度的数据，如表1。 夜晚城市的灯光构成了城市的点滴。夜光指数主要是利用卫星采集的图像，针对不同地区采用不同的降噪系数体系，计算出夜晚灯光的强弱来反映人类活动的频繁程度，从而推演出一个地区的经济发展情况，以及夜晚经济的繁华程度。夜光指数常被学者用来研究经济社会的发展动态，例如，有人用夜光遥感技术来研究“一带一路”沿线部分国家近20 年的经济发展规律[李德仁and 李熙, 2015]。因此，本文使用卫星采集并由佳格望眼计算的中国各城市夜光指数来作为城市的一维经济特征。 为了避免行政区划因素带来的影响（例如市辖县过多），人口密度指城区内的人口密度。人口密度=（城区人口+ 城区暂住人口）/城区面积。由于各地级市公布的GDP 都为全市级别的，为方便计算人均GDP，本文GDP、常住人口、人均GDP 采用了整个地级市层面的数据。 我们用各地级市单位GDP 的耗电量来代表当地经济绿色发展的水平。单位GDP 耗电量是某地级市全社会耗电量总量与该市生产总值的比率，是反映能源消费水平和节能降耗状况的主要指标。该指标说明一个城市经济活动的结构和能源利用的效率。单位GDP 产出的耗电量在不同城市间往往差距很大，例如，“胡焕庸线”西侧城市单位GDP 的电耗已经达到东部城市的1.8 倍左右。 教育公共预算支出是各地政府财政部门的财政预算中实际用于教育的费用支出，对教育方面的投入有助于培育更多的人力资本。而公共预算中的科学技术支出代表一个城市保障关键核心科学技术攻关的力度。本文使用各地级市政府一般公共预算支出以及其中的教育和科学技术支出，来代表该城市对人力资本培养和科学技术发展的支持力度。 3 方法3.1 高斯混合模型的定义高斯混合模型（Gaussian Mixture Model）将所有样本点分为 K 个簇，每个簇符合一个多维高斯分布 [Do, 2008]。GMM 使用这 K 个高斯分布概率密度函数的加权和作为其概率密度函数： \\begin{equation} p(x ; \\Theta)=\\sum_{k=1}^{K} \\alpha_{k} \\cdot \\mathcal{N}\\left(x ; \\vec{u}_{k}, \\Sigma_{k}\\right) \\end{equation}其中，该概率密度函数的参数 \\begin{equation} \\Theta=\\left\\{\\alpha_{k}, \\vec{u}_{k}, \\Sigma_{k}\\right\\}_{k=1}^K \\end{equation}为了保证GMM的概率密度函数在区间$(-\\infty,+\\infty)$上的积分为1, 我们有 \\begin{equation} \\int_{-\\infty}^{+\\infty} p(x ; \\Theta) d x=\\sum_{k=1}^{K}\\left[\\alpha_{k} \\int_{-\\infty}^{+\\infty} \\mathcal{N}\\left(x ; \\vec{u}_{k}, \\Sigma_{k}\\right) d x\\right]=\\sum_{k=1}^{K} \\alpha_{k}=1 \\end{equation}若我们很清楚地知道整个数据集的采样过程，即我们知道样本$x_i$是从第$z_i$个高斯分布簇采样得到，那我们可以通过构造NLL函数很轻松得到各个簇的参数值。但事实上，我们并不清楚各个高斯分布簇的分布情况以及样本点的采样过程，上述参数估计过程无法实现。因此我们采用EM算法进行参数估计。 3.2 EM算法在GMM模型的实现在《数学之美》这本书中，EM 算法被誉为“上帝的算法”。EM 算法延续了 MLE 的思路, 通过不断地构造对数似然函数的下界函数, 并对这个较为容易求解的下界函数进行最优化, 以增大对数似然函数取值的下界, 使得在不断的迭代操作后, 对数似然函数的取值能逼近最大值, 从而完成参数估计 [Dempster et al., 1977]。 \\begin{equation} \\begin{aligned} \\mathcal{L} \\mathcal{L}(\\Theta) &=\\sum_{i=1}^{n} \\log \\left[\\sum_{z_{i}} p\\left(x_{i}, z_{i} ; \\Theta\\right)\\right] \\\\\\\\ &=\\sum_{i=1}^{n} \\log \\left[\\sum_{z_{i}} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right) \\cdot \\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\end{aligned} \\end{equation}其中，$p\\left(z_{i} \\mid x_{i}; \\Theta_{t-1}\\right)$为给定第$t-1$次迭代后$z_{i}$关于$x_{i}$的后验分布： \\begin{equation} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)=\\frac{p\\left(x_{i} \\mid z_{i} ; \\Theta_{t-1}\\right) \\cdot p\\left(z_{i} ; \\Theta_{t-1}\\right)}{\\sum_{z_{i}} p\\left(x_{i} \\mid z_{i} ; \\Theta_{t-1}\\right) \\cdot p\\left(z_{i} ; \\Theta_{t-1}\\right)} \\end{equation}使用这个关于$z_{i}$的后验分布构造期望： \\begin{equation} \\mathbf{E}_{z_{i}}\\left[\\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right]=\\sum_{z_{i}} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right) \\cdot \\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)} \\end{equation}由琴生不等式 [McShane, 1937]， \\begin{equation} \\log \\mathbf{E}_{z_{i}}\\left[\\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\geq \\mathbf{E}_{z_{i}}\\left[\\log \\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\end{equation}即 \\begin{equation} \\log \\left[\\sum_{z_{i}} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right) \\cdot \\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\geq \\sum_{z_{i}} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right) \\cdot \\log \\left[\\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\end{equation}因此，对数似然函数 \\begin{equation} \\begin{aligned} \\mathcal{L} \\mathcal{L}(\\Theta) &=\\sum_{i=1}^{n} \\log \\left[\\sum_{z_{i}} p\\left(x_{i}, z_{i} ; \\Theta\\right)\\right] \\\\\\\\ &=\\sum_{i=1}^{n} \\log \\left[\\sum_{z_{i}} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right) \\cdot \\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\\\\\\\ & \\geq \\sum_{i=1}^{n} \\sum_{z_{i}} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right) \\cdot \\log \\left[\\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\end{aligned} \\end{equation}我们定义下界函数，作为EM算法中的Expectation： \\begin{equation} \\begin{aligned} \\mathcal{Q}\\left(\\Theta, \\Theta_{t-1}\\right) &=\\sum_{i=1}^{n} \\sum_{z_{i}} p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right) \\cdot \\log \\left[\\frac{p\\left(x_{i}, z_{i} ; \\Theta\\right)}{p\\left(z_{i} \\mid x_{i} ; \\Theta_{t-1}\\right)}\\right] \\end{aligned} \\end{equation}因此 \\begin{equation} \\mathcal{L} \\mathcal{L}(\\Theta) \\geq \\mathcal{Q}\\left(\\Theta, \\Theta_{t-1}\\right) \\end{equation}我们将最优化下界函数得到的$\\Theta$作为$\\Theta_{t}$,这一步也被称作EM算法中的Maximum： \\begin{equation} \\Theta_{t}=\\underset{\\Theta}{\\operatorname{argmax}} \\mathcal{Q}\\left(\\Theta, \\Theta_{t-1}\\right) \\end{equation}重复以上E-M步骤，直到达到我们指定的迭代次数或者$\\Theta_{t}$不再变化。可以证明，对数似然函数满足收敛性，即$\\mathcal{L L}\\left(\\Theta_{t}\\right) \\geq \\mathcal{L L}\\left(\\Theta_{t-1}\\right), t \\in[1,+\\infty)$，证明过程本文略。 3.3 代入多维高斯模型的参数对于每个高斯分布簇，$\\Theta_{t-1}=\\left\\{\\alpha_{k}^{t-1}, \\vec{u}_{k}^{t-1}, \\Sigma_{k}^{t-1}\\right\\}_{k=1}^{K}$，代入各参数，求得下界函数为 \\begin{equation} \\begin{aligned} \\mathcal{Q}\\left(\\Theta, \\Theta_{t-1}\\right) &=\\sum_{i=1}^{n} \\sum_{k=1}^{K} q_{i k}\\left[-\\frac{n}{2} \\log 2 \\pi-\\frac{1}{2} \\log \\left|\\Sigma_{k}\\right|-\\frac{1}{2} \\cdot\\left[\\left(x_{i}-\\vec{\\mu}_{k}\\right)^{\\top} \\Sigma_{k}^{-1}\\left(x_{i}-\\vec{\\mu}_{k}\\right)\\right]+\\log \\alpha_{k}-\\log q_{i k}\\right] \\\\\\\\ &=\\sum_{i=1}^{n} \\sum_{k=1}^{K} q_{i k}\\left[-\\frac{1}{2} \\log \\left|\\Sigma_{k}\\right|-\\frac{1}{2} \\cdot\\left[\\left(x_{i}-\\vec{\\mu}_{k}\\right)^{\\top} \\Sigma_{k}^{-1}\\left(x_{i}-\\vec{\\mu}_{k}\\right)\\right]+\\log \\alpha_{k}\\right] \\end{aligned} \\end{equation}下界函数对参数求偏导，最终得到各参数迭代后的取值 4 实验与分析4.1 最优簇个数的确定我们使用 Calinski-Harabaz 指数 [Kwon et al., 2017] 来确定最优的高斯分布的簇数，Calinski-Harabaz指数定义为 \\begin{equation} s(k)=\\frac{\\operatorname{Tr}\\left(B_{k}\\right)}{\\operatorname{Tr}\\left(W_{k}\\right)} \\times \\frac{N-k}{k-1} \\end{equation}其中$W_{k}=\\sum_{q=1}^{k} \\sum_{x \\in C_{q}}\\left(x-c_{q}\\right)\\left(x-c_{q}\\right)^{T}$为簇内分散矩阵，$B_{k}=\\sum_{q} n_{q}\\left(c_{q}-c\\right)\\left(c_{q}-c\\right)^{T}$为簇间分散矩阵，$c_{q}$为第q个簇的中心点，$c$为整个样本集的中心点。Calinski-Harabaz指数越大，代表各类之间联系越紧密而不同类之间越分散，则聚类效果越好。 通过指定簇数为2-6,用我们的城市样本数据集计算了不同簇个数对应的Calinski-Harabaz指数，计算结果如图1。根据结果，我们最终确定最优簇个数为5，即中国城市被分为5个等级。 4.2 中国城市聚类结果我们已经通过计算得出中国城市聚类的最优簇数，给定最优簇数5，我们对中国290个地级市的十维数据进行高斯混合聚类，聚类结果如图2。 根据聚类结果，我们可以给出我们模型得到的中国城市等级，如表2。 5 讨论 根据高斯混合模型以及CH指数，我们得出中国的地级市大体上可以分为五个簇，每个簇符合一个高斯分布。我们将实验结果与媒体所评选出的一二三线商业城市进行对比，发现结果相似，证明高斯混合聚类在中国城市等级划分上具有良好的效果。和媒体的城市分级结果不同，我们的分级未指定每个簇应该有的城市个数，数据集也不仅仅集中在商业领域，因此我们的结果会与媒体评出的有差异。但由于我们的结果是由计算机根据数学模型计算得到，因此会有较好的后续学术应用性。 由于《中国城市统计年鉴》上的数据多为整个地级市行政区划内的数据，而并非自然生长的城区数据，因此，数据集可能受行政区划以及区划调整影响过大。例如，虽然人口密度等维度我们采用的是城区数据，但GDP、公共预算支出却很难做到以城区为口径。因此，国家统计局城市司建议使用“市辖区”作为统计口径[张丽萍, 2020]以剔除各城市市辖县数目差异带来的偏差，剔除我国城市的非城市因素，若可以获得市辖区级别的各地级市数据，聚类结果会更加贴合实际情况。 需要强调的是，本文旨在提出城市分级的一种可能的方法，而不代表最终分级的结果。事实上，受制于数据的可获得性，本文仅采用了城市十个维度的数据，并且主要是宏观数据。高斯混合模型往往在数据维度更高时会获得更准确的分类结果。因此，在实际操作时，可以考虑在信息、知识、资本、外资吸引力、机场港口、交通系统与通信设备等方面增加更多维度的城市数据。同时不仅关注宏观，也要聚焦微观个体，例如一线品牌、跨国公司的数量和密度。 本文所采用数据基本是城市的静态数据，而未从“联系”的视角来考察中国城市。事实上，由于经贸人员往来，中国城市已成为一个相互联系的网络体系。同时随着经济全球化的发展，国际分工的明确，中国城市与国外城市的连接也越来越复杂。如何利用好例如高铁、航班、人口流、资金流等“关系型数据”，从基于城市联系的角度将网络分析与本文方法结合起来，是后续值得改进的方向。 正如前所述，城市等级划分意义深远。学术上来说，城市等级不仅仅可以作为计量经济学模型中的一个变量，在后续的研究中，还可以考虑依据我们聚类得到的标签，在一个城市群（City cluster）内部研究拓扑结构（例如卫星城效应、城市群混沌程度等），前景广阔。实际来看，城市分级对于厘清城市之间的差异和联系，乃至各城市制定科学的发展战略，都有重要的意义。 参考文献Jordan Rappaport et al. A guide to aggregate house price measures. Economic Review-Federal Reserve Bank of Kansas City, 92(2):41, 2007. 郭靖and 倪鹏飞. 新视角下全球城市分级的理论依据与实践启示. 区域经济评论, 2021. John Friedmann. The world city hypothesis. Development and Change, 17(1):69–83, 1986. S Sassen. The global city: New york, london, tokyo. princeton, oxford: Princeton university press. 2001. 张丽萍. “x 线城市”——中国城市分级方法探讨. 中国统计, 2020. Edwin T Jaynes. Information theory and statistical mechanics. Physical review, 106(4):620, 1957. 李德仁and 李熙. 夜光遥感技术在评估经济社会发展中的应用——兼论其对“一带一路”建设质量的保障. 宏观质量研究, 3(4):1–8, 2015. Chuong B Do. More on multivariate gaussians. URL http://cs229. stanford. edu/section/more_on_gaussians. pdf.[Online, 2008. Arthur P Dempster, Nan M Laird, and Donald B Rubin. Maximum likelihood from incomplete data via the em algorithm. Journal of the Royal Statistical Society: Series B (Methodological), 39(1):1–22, 1977. Edward James McShane. Jensen’s inequality. Bulletin of the American Mathematical Society, 43(8):521–527, 1937. Bum Chul Kwon, Ben Eysenbach, Janu Verma, Kenney Ng, Christopher De Filippi, Walter F Stewart, and Adam Perer. Clustervision: Visual supervision of unsupervised clustering. IEEE transactions on visualization and computer graphics, 24(1):142–151, 2017.","link":"/2022/05/21/GMMCityClustering/"},{"title":"An interpretation of 《Metalearners for estimating heterogeneous treatment effects using machine learning》","text":"“There is growing interest in estimating and analyzing heterogeneous treatment effects in experimental and observational studies. We describe a number of metaalgorithms that can take advantage of any supervised learning or regression method in machine learning and statistics to estimate the conditional average treatment effect (CATE) function. Metaalgorithms build on base algorithms—such as random forests (RFs), Bayesian additive regression trees (BARTs), or neural networks—to estimate the CATE, a function that the base algorithms are not designed to estimate directly.” 1 Brief Introduction1.1 Why Machine Learning? “同样是拟合一个线性回归模型，传统的社会科学研究者将注意力放在这个模型中特定自变量的系数上，而机器学习的目的则是看这个回归模型多大程度上可以预测因变量的取值。这种关注点上的区分非常重要。因为我们在进行模型拟合时所需要特别关注的问题（例如共线性等）在机器学习的分析范式下便不再是问题。只要有助于提升预测的准确度，我们的模型拟合过程完全可以变得非常有弹性。” “所谓的‘因果推断的基本问题’，本质上是一个缺失值问题，而为了解决缺失值问题，我们就需要利用已有的资料进行某种意义上的“预测”，这恰恰是机器学习方法的强项所在。” ——胡安宁，《中国社会科学报》 传统回归模型的交互项分析主要有两个问题：交互项不能无限制添加，以及交互项的设定具有主观性。倾向值方法存在模型和系数不确定，以及无法确定具体起异质化作用的混淆变量的问题。 ——胡安宁,吴晓刚,陈云松, 《处理效应异质性分析——机器学习方法带来的机遇与挑战》 Casual Tree: Athey S, Imbens G. Recursive partitioning for heterogeneous causal effects[J]. Proceedings of the National Academy of Sciences, 2016, 113(27): 7353-7360. Casual Forests: Wager S, Athey S. Estimation and inference of heterogeneous treatment effects using random forests[J]. Journal of the American Statistical Association, 2018, 113(523): 1228-1242. BART: Chipman H A , Mcculloch G R E . BART: BAYESIAN ADDITIVE REGRESSION TREES[J]. Annals of Applied Statistics, 2010, 4(1):266-298. Transfer Learning: Künzel S R, Stadie B C, Vemuri N, et al. Transfer learning for estimating causal effects using neural networks[J]. arXiv preprint arXiv:1808.07804, 2018. 1.2 Framework and Definitions We use the following representation of $\\mathcal{P}$ : \\begin{aligned} X & \\sim \\Lambda \\\\\\\\ W & \\sim \\operatorname{Bern}(e(X)) \\\\\\\\ Y(0) &=\\mu_{0}(X)+\\varepsilon(0) \\\\\\\\ Y(1) &=\\mu_{1}(X)+\\varepsilon(1) \\end{aligned} $\\left(Y_{i}(0), Y_{i}(1), X_{i}, W_{i}\\right) \\sim \\mathcal{P}$, where $X_{i} \\in \\mathbb{R}^{d}$ is a $d$-dimensional covariate or feature vector, $W_{i} \\in\\{0,1\\}$ is the treatment-assignment indicator (to be defined precisely later), $Y_{i}(0) \\in \\mathbb{R}$ is the potential outcome of unit $i$ when $i$ is assigned to the control group, and $Y_{i}(1)$ is the potential outcome when $i$ is assigned to the treatment group. With this definition, the ATE is defined as \\mathrm{ATE}:=\\mathbb{E}[Y(1)-Y(0)] the response under control $\\mu_{0}(x):=\\mathbb{E}[Y(0) \\mid X=x] \\quad$ the response under treatment$\\quad \\mu_{1}(x):=\\mathbb{E}[Y(1) \\mid X=x]$ For a new unit $i$ with covariate vector $x_{i}$, to decide whether to give the unit the treatment, we wish to estimate the ITE of unit $i, D_{i}$, which is defined as D_{i}=Y_{i}(1)-Y_{i}(0) . the CATE function is defined as \\tau(x)=\\mathbb{E}[D \\mid X=x]=\\mathbb{E}[Y(1)-Y(0) \\mid X=x], Condition 1: (\\varepsilon(0), \\varepsilon(1)) \\perp W \\mid X .Condition 2: There exists $e_{\\min }$ and $e_{\\max }$, such that for all $x$ in the support of $X$, 0","link":"/2022/05/20/metalearner/"}],"tags":[{"name":"Machine Learning","slug":"Machine-Learning","link":"/tags/Machine-Learning/"},{"name":"Urban Governance","slug":"Urban-Governance","link":"/tags/Urban-Governance/"},{"name":"Research","slug":"Research","link":"/tags/Research/"},{"name":"Mathematics","slug":"Mathematics","link":"/tags/Mathematics/"},{"name":"Quant","slug":"Quant","link":"/tags/Quant/"},{"name":"Reading Notes","slug":"Reading-Notes","link":"/tags/Reading-Notes/"},{"name":"Causal Inference","slug":"Causal-Inference","link":"/tags/Causal-Inference/"}],"categories":[{"name":"Research","slug":"Research","link":"/categories/Research/"},{"name":"Reading Notes","slug":"Reading-Notes","link":"/categories/Reading-Notes/"},{"name":"Urban Governance","slug":"Research/Urban-Governance","link":"/categories/Research/Urban-Governance/"},{"name":"Machine Learning","slug":"Research/Machine-Learning","link":"/categories/Research/Machine-Learning/"},{"name":"Mathematics","slug":"Research/Mathematics","link":"/categories/Research/Mathematics/"},{"name":"Machine Learning","slug":"Reading-Notes/Machine-Learning","link":"/categories/Reading-Notes/Machine-Learning/"}]}